jack77er/openUTRUSTA/Packages/.cache/Infineon.TLE986x_DFP.1.2.1.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <license>Licence\CMSIS_END_USER_LICENCE_AGREEMENT.txt</license>  
  <vendor>Infineon</vendor>
  <url>http://media.infineon.com/mdk/</url>
  <name>TLE986x_DFP</name>
  <description>Infineon TLE986x Series Device Support</description>
  <supportContact>http://www.infineon.com/cms/en/corporate/company/contact/support/index.html</supportContact>
  
  <releases>
   <release version="1.2.3">
      SDK update
	  NVM Data Flash Handling example added
    </release>
   <release version="1.2.2">
      SVD file update
   </release>
   <release version="1.2.1">
      updated pdsc file, updated example structure
    </release>
   <release version="1.2.0">
      updated pdsc file, updated example structure
    </release>
   <release version="1.1.0">
      TLE986x Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Infineon</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Infineon</keyword>
    <keyword>TLE986x</keyword>
  </keywords>

  <devices>
    <family Dfamily="TLE98xx Series" Dvendor="Infineon:7">
      <processor Dcore="Cortex-M3" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian"/>

      <description>
        The TLE986x series is designed for 2-phase motor drive applications with LIN/PWM interface
        - Ultra low power consumption
        - Nested Vectored Interrupt Controller (NVIC)
        - integrated LIN tranceiver (selected derivates)
        - DMA (selected derivates)
        - Current Sense Amplifier (selected drivates)
      </description>

      <environment name="uv">
        <AMisc>--cpreproc</AMisc>
      </environment>

      <feature type="WDT"           n="1"/>
      <feature type="ComOther"      n="2"                           name="Universal Serial Interface"/>
      <feature type="Temp"          n="-40"     m="150"             name="all Devices"/>
      <!--<feature type="BDRV"           n="2"/>-->

      <subFamily DsubFamily="TLE986x Series">

		  <device Dname="TLE9861QXA20">
			<processor Dclock="24000000"/>
			<compile header="Device\Include\TLE986x.h" define="TLE9861QXA20"/>
			<debug      svd="SVD\TLE986x.svd"/>
			<memory     id="IROM1"                      start="0x11000000"  size="0x7FFC"     startup="1"   default="1"/>
			<memory     id="IROM2"                      start="0x11007FFC"  size="4"          startup="0"   default="1"/>
			<memory     id="IRAM1"                      start="0x18000000"  size="0xC00"      init   ="0"   default="1"/>
			<algorithm  name="Flash\TLE9861.FLM"     start="0x11000000"  size="0x8000"                      default="1"/>
			<book    name="Documents\TLE986xQX-Users-Manual-10-Infineon.pdf"   title="TLE986x Series Reference Manual"/>
			<book    name="Documents\TLE986xQX-BootROM-User-Manual-13-Infineon.pdf"   title="TLE986x Series BootROM Manual"/>
			<book    name="Documents\TLE9861QXA20-Data-Sheet-10-Infineon.pdf"  title="TLE9861QXA20 Data Sheet"/>
			<feature type="ADC"           n="1"       m="10"/>
			<feature type="ADC"           n="1"       m="8"/>
			<feature type="IOs"           n="11"/>
		  </device>
		  <device Dname="TLE9867QXA20">
			<processor Dclock="24000000"/>
			<compile header="Device\Include\TLE986x.h" define="TLE9867QXA20"/>
			<debug      svd="SVD\TLE986x.svd"/>
			<memory     id="IROM1"                      start="0x11000000"  size="0xEFFC"     startup="1"   default="1"/>
			<memory     id="IROM2"                      start="0x1100EFFC"  size="4"          startup="0"   default="1"/>
			<memory     id="IRAM1"                      start="0x18000000"  size="0x1800"     init   ="0"   default="1"/>
			<algorithm  name="Flash\TLE9867.FLM"     start="0x11000000"  size="0x10000"                     default="1"/>
			<book    name="Documents\TLE986xQX-Users-Manual-10-Infineon.pdf"   title="TLE986x Series Reference Manual"/>
			<book    name="Documents\TLE986xQX-BootROM-User-Manual-13-Infineon.pdf"   title="TLE986x Series BootROM Manual"/>
			<book    name="Documents\TLE9867QXA20-Data-Sheet-10-Infineon.pdf"  title="TLE9867QXA20 Data Sheet"/>
			<feature type="ADC"           n="1"       m="10"/>
			<feature type="ADC"           n="1"       m="8"/>
			<feature type="IOs"           n="11"/>
		  </device>
		  <device Dname="TLE9867QXA40">
			<processor Dclock="40000000"/>
			<compile header="Device\Include\TLE986x.h" define="TLE9867QXA40"/>
			<debug      svd="SVD\TLE986x.svd"/>
			<memory     id="IROM1"                      start="0x11000000"  size="0xEFFC"     startup="1"   default="1"/>
			<memory     id="IROM2"                      start="0x1100EFFC"  size="4"          startup="0"   default="1"/>
			<memory     id="IRAM1"                      start="0x18000000"  size="0x1800"     init   ="0"   default="1"/>
			<algorithm  name="Flash\TLE9867.FLM"     start="0x11000000"  size="0x10000"                     default="1"/>
			<book    name="Documents\TLE986xQX-Users-Manual-10-Infineon.pdf"   title="TLE986x Series Reference Manual"/>
			<book    name="Documents\TLE986xQX-BootROM-User-Manual-13-Infineon.pdf"   title="TLE986x Series BootROM Manual"/>
			<book    name="Documents\TLE9867QXA40-Data-Sheet-10-Infineon.pdf"  title="TLE9867QXA40 Data Sheet"/>
			<feature type="ADC"           n="1"       m="10"/>
			<feature type="ADC"           n="1"       m="8"/>
			<feature type="IOs"           n="11"/>
		  </device>
		  <device Dname="TLE9869QXA20">
			<processor Dclock="24000000"/>
			<compile header="Device\Include\TLE986x.h" define="TLE9869QXA20"/>
			<debug      svd="SVD\TLE986x.svd"/>
			<memory     id="IROM1"                      start="0x11000000"  size="0x1EFFC"     startup="1"   default="1"/>
			<memory     id="IROM2"                      start="0x1101EFFC"  size="4"           startup="0"   default="1"/>
			<memory     id="IRAM1"                      start="0x18000000"  size="0x1800"      init   ="0"   default="1"/>
			<algorithm  name="Flash\TLE9869.FLM"     start="0x11000000"  size="0x20000"                      default="1"/>
			<book    name="Documents\TLE986xQX-Users-Manual-10-Infineon.pdf"   title="TLE986x Series Reference Manual"/>
			<book    name="Documents\TLE986xQX-BootROM-User-Manual-13-Infineon.pdf"   title="TLE986x Series BootROM Manual"/>
			<book    name="Documents\TLE9869QXA20-Data-Sheet-10-Infineon.pdf"  title="TLE9869QXA20 Data Sheet"/>
			<feature type="ADC"           n="1"       m="10"/>
			<feature type="ADC"           n="1"       m="8"/>
			<feature type="IOs"           n="11"/>
		  </device>
      </subFamily>
   </family>
  </devices>

  <conditions>                                                                
  <!-- conditions are dependency rules that can apply to a component or an individual file -->
    <condition id="TLE986x CMSIS Device">                                     
    <!-- conditions selecting Devices -->
      <description>Infineon TLE986x device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Cclass="Device" Cgroup="SDK" Csub="SCU"/>
      <require Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
      <require Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
      <require Cclass="Device" Cgroup="SDK" Csub="ISR"/>
      <require Cclass="Device" Cgroup="SDK" Csub="INT"/>
      <require Dvendor="Infineon:7" Dname="TLE986*QXA*"/>
    </condition>

