jack77er/openUTRUSTA/Packages/.cache/Infineon.TLE986x_DFP.1.2.1.pdsc
    <condition id="TLE986x">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE986x device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE986*QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="TLE9861QXA20">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9861QXA20 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9861QXA20"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9867QXA20">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9867QXA20 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9867QXA20"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9867QXA40">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9867QXA40 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9867QXA40"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9869QXA20">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9869QXA20 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9869QXA20"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="TLE9861 ARM">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9861 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9861QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9867 ARM">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9867 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9867QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9869 ARM">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9869 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9869QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
  </conditions>

    <boards>
     <board vendor="Infineon" name="TLE986x Eval.Board" revision="V1.2" salesContact="sales@infineon.com" orderForm="http://www.infineon.com/embeddedpower">
      <description>Infineon TLE9869 Eval. Board Support and Examples</description>
      <image small="Images\TLE986x-EvalBoard-rev1_small.jpg" large="Images\TLE986x-EvalBoard-rev1_1_big.jpg"/>
      <book category="overview"  name="http://www.infineon.com/cms/en/product/evaluation-boards/TLE986X+EVALBOARD/evaluation-boards/TLE986X+EVALBOARD/productType.html?productType=5546d46249cd10140149e1ff081a5d2d" title="TLE986x Eval.Board Web Page"/>
      <book category="setup"     name="Documents\IFX_TLE986x_EvalBoard.pdf" title="Getting Started"/>
      <book category="schematic" name="Documents\TLE986x_ver_1.2.zip" title="Schematics"/>
      <!--<mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="TLE9869QXA20"/>-->
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE986x Series"/>
  	    <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
	    <feature type="PWR"       n="5"              name="USB Powered"/>
	    <feature type="PWR"       n="12" m="5"      name="POWER Connector for external supply"/>
	    <feature type="DIO"       n="13"             name="Pins at pin headers"/>
	    <feature type="AIO"       n="3"              name="Analog inputs at AD"/>
	    <feature type="LED"       n="8"              name="User LEDs"/>
      <debugInterface adapter="J-Link Lite" connector="Mini-USB"/>
    </board>
  </boards>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TLE986x CMSIS Device">  <!-- Cversion is necessary -->
      <description>System Startup for Infineon TLE986x device series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>
		
		<!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_TLE986x.s" condition="TLE9861 ARM" version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE986x.s" condition="TLE9867 ARM" version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE986x.s" condition="TLE9869 ARM" version="1.0"/>

		<!-- system file -->      
        <file category="source" name="Device\Source\system_TLE986x.c" condition="TLE9861 ARM" version="1.1"/>
        <file category="source" name="Device\Source\system_TLE986x.c" condition="TLE9867 ARM" version="1.1"/>
        <file category="source" name="Device\Source\system_TLE986x.c" condition="TLE9869 ARM" version="1.1"/>

        <file category="include" name="Device\SDK\cfgwiz\TLE9861QXA20\" condition="TLE9861QXA20"/>      
        <file category="include" name="Device\SDK\cfgwiz\TLE9861QXA20\" condition="TLE9867QXA20"/>      
        <file category="include" name="Device\SDK\cfgwiz\TLE9867QXA40\" condition="TLE9867QXA40"/>      
        <file category="include" name="Device\SDK\cfgwiz\TLE9869QXA20\" condition="TLE9869QXA20"/>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\bsl_defines.h" attr="config" condition="TLE9861QXA20" version="1.8"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\bsl_defines.h" attr="config" condition="TLE9867QXA20" version="1.8"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\bsl_defines.h" attr="config" condition="TLE9867QXA40" version="1.8"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\bsl_defines.h" attr="config" condition="TLE9869QXA20" version="1.8"/>   

